SiliconLabs/matter_extension/third_party/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
void BLEManagerImpl::StartBleAdvTimeoutTimer(uint32_t aTimeoutInMs)
{
    if (osTimerStart(sbleAdvTimeoutTimer, pdMS_TO_TICKS(aTimeoutInMs)) != osOK)
    {
        ChipLogError(DeviceLayer, "Failed to start BledAdv timeout timer");
    }
}

void BLEManagerImpl::DriveBLEState(intptr_t arg)
{
    sInstance.DriveBLEState();
}

bool BLEManagerImpl::CanHandleEvent(uint32_t event)
{
    bool canHandle = (event == sl_bt_evt_system_boot_id || event == sl_bt_evt_connection_opened_id ||
                      event == sl_bt_evt_connection_parameters_id || event == sl_bt_evt_connection_phy_status_id ||
                      event == sl_bt_evt_connection_data_length_id || event == sl_bt_evt_connection_closed_id ||
                      event == sl_bt_evt_gatt_server_attribute_value_id || event == sl_bt_evt_gatt_mtu_exchanged_id ||
                      event == sl_bt_evt_gatt_server_characteristic_status_id || event == sl_bt_evt_system_soft_timer_id ||
                      event == sl_bt_evt_gatt_server_user_read_request_id || event == sl_bt_evt_connection_remote_used_features_id);
    VerifyOrReturnValue(canHandle == false, true);

    if (mBleSideChannel != nullptr)
    {
        // The side channel and the CHIPoBLE service support the same events, but we give the possibility for implementation of the
        // side channel to support more.
        canHandle = canHandle || mBleSideChannel->CanHandleEvent(event);
    }

    return canHandle;
}

void BLEManagerImpl::ParseEvent(volatile sl_bt_msg_t * evt)
{
    // As this is running in a separate thread, and we determined this is a matter related event,
    // we need to block CHIP from operating, until the events are handled.
    // Todo: Move inside the MatteroBLE channel once created and verify if lock is necessary for other channels
    // Ideally at this level we just want to pick the channel and the each channel can have its own switch case
    chip::DeviceLayer::PlatformMgr().LockChipStack();

    switch (SL_BT_MSG_ID(evt->header))
    {
    case sl_bt_evt_system_boot_id: {
        ChipLogProgress(DeviceLayer, "Bluetooth stack booted: v%d.%d.%d-b%d", evt->data.evt_system_boot.major,
                        evt->data.evt_system_boot.minor, evt->data.evt_system_boot.patch, evt->data.evt_system_boot.build);
        HandleBootEvent();

        RAIL_Version_t railVer;
        RAIL_GetVersion(&railVer, true);
        ChipLogProgress(DeviceLayer, "RAIL version:, v%d.%d.%d-b%d", railVer.major, railVer.minor, railVer.rev, railVer.build);
        sl_bt_connection_set_default_parameters(BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL, BLE_CONFIG_LATENCY,
                                                BLE_CONFIG_TIMEOUT, BLE_CONFIG_MIN_CE_LENGTH, BLE_CONFIG_MAX_CE_LENGTH);
    }
    break;

    case sl_bt_evt_connection_opened_id: {
        HandleConnectEvent(evt);
    }
    break;
    case sl_bt_evt_connection_parameters_id: {
        ChipLogProgress(DeviceLayer, "Connection parameter ID received - i:%d, l:%d, t:%d, sm:%d",
                        evt->data.evt_connection_parameters.interval, evt->data.evt_connection_parameters.latency,
                        evt->data.evt_connection_parameters.timeout, evt->data.evt_connection_parameters.security_mode);
        HandleConnectParams(evt);
    }
    break;
    case sl_bt_evt_connection_phy_status_id: {
        ChipLogProgress(DeviceLayer, "Connection phy status ID received - phy:%d", evt->data.evt_connection_phy_status.phy);
    }
    break;
    case sl_bt_evt_connection_data_length_id: {
        ChipLogProgress(DeviceLayer, "Connection data length ID received - txL:%d, txT:%d, rxL:%d, rxL:%d",
                        evt->data.evt_connection_data_length.tx_data_len, evt->data.evt_connection_data_length.tx_time_us,
                        evt->data.evt_connection_data_length.rx_data_len, evt->data.evt_connection_data_length.rx_time_us);
    }
    break;
    case sl_bt_evt_connection_closed_id: {
        HandleConnectionCloseEvent(evt);
    }
    break;

    /* This event indicates that a remote GATT client is attempting to write a value of an
     * attribute in to the local GATT database, where the attribute was defined in the GATT
     * XML firmware configuration file to have type="user".  */
    case sl_bt_evt_gatt_server_attribute_value_id: {
        HandleWriteEvent(evt);
    }
    break;

    case sl_bt_evt_gatt_mtu_exchanged_id: {
        UpdateMtu(evt);
    }
    break;

    // confirmation of indication received from remote GATT client
    case sl_bt_evt_gatt_server_characteristic_status_id: {
        sl_bt_gatt_server_characteristic_status_flag_t StatusFlags;

        StatusFlags = (sl_bt_gatt_server_characteristic_status_flag_t) evt->data.evt_gatt_server_characteristic_status.status_flags;

        if (sl_bt_gatt_server_confirmation == StatusFlags)
        {
            if (isMATTERoBLECharacteristic(evt->data.evt_gatt_server_characteristic_status.characteristic))
            {
                HandleTxConfirmationEvent(evt->data.evt_gatt_server_characteristic_status.connection);
            }
            else if (mBleSideChannel != nullptr &&
                     mBleSideChannel->GetConnectionHandle() == evt->data.evt_gatt_server_characteristic_status.connection)
            {
                mBleSideChannel->HandleIndicationConfirmation(evt);
            }
        }
        else
        {
            HandleTXCharCCCDWrite(evt);
        }
    }
    break;

    /* Software Timer event */
    case sl_bt_evt_system_soft_timer_id: {
        HandleSoftTimerEvent(evt);
    }
    break;

    case sl_bt_evt_gatt_server_user_read_request_id: {
        ChipLogProgress(DeviceLayer, "GATT server user_read_request");
#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
        if (evt->data.evt_gatt_server_user_read_request.characteristic == gattdb_CHIPoBLEChar_C3)
        {
            HandleC3ReadRequest(evt);
        }
#endif // CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
    }
    break;

    case sl_bt_evt_connection_remote_used_features_id: {
        // ChipLogProgress(DeviceLayer, "link layer features supported by the remote device");
    }
    break;

    case sl_bt_evt_gatt_server_indication_timeout_id: {
        // Only handled by the Side Channel
        if (mBleSideChannel != nullptr)
        {
            mBleSideChannel->HandleIndicationTimeout(evt);
        }
        break;
    }
    default: {
        ChipLogProgress(DeviceLayer, "evt_UNKNOWN id = %08" PRIx32, SL_BT_MSG_ID(evt->header));
        break;
    }
    }

    // Unlock the stack
    chip::DeviceLayer::PlatformMgr().UnlockChipStack();
}

} // namespace Internal
} // namespace DeviceLayer
} // namespace chip
#ifdef SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
extern "C" void zigbee_bt_on_event(volatile sl_bt_msg_t * evt);
#endif // SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT

// TODO: Move this to matter_bl_event.cpp and update gn and slc build files
extern "C" void sl_bt_on_event(sl_bt_msg_t * evt)
{
    if (chip::DeviceLayer::Internal::BLEMgrImpl().CanHandleEvent(SL_BT_MSG_ID(evt->header)))
    {
        chip::DeviceLayer::Internal::BLEMgrImpl().ParseEvent(evt);
    }
#ifdef SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
    zigbee_bt_on_event(evt);
#endif // SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_CHIPOBLE
